function [BPSEE1, BPS1, BPSEE2] = BARKenergy(x, fs)
    %提取bark子带能量，以及每个子带的修正频谱质心
    %输入为信号x，采样率fs
    Fk = [50 20 100; 150 100 200; 250 200 300; 350 300 400; 450 400 510; 570 510 630; 700 630 770; ...
            840 770 920; 1000 920 1080; 1170 1080 1270; 1370 1270 1480; 1600 1480 1720; 1850 1720 2000; ...
            2150 2000 2320; 2500 2320 2700; 2900 2700 3150; 3400 3150 3700; 4000 3700 4400; ...
            4800 4400 5300; 5800 5300 6400; 7000 6400 7700; 8500 7700 9500; 10500 9500 12000; ...
            13500 12000 15500; 18775 15500 22050]; %bark子带表，分别包装了起始频率，中心频率，截止频率

    wlen = fix(0.05 * fs);
    inc = fix(0.5 * wlen);
    wnd = hamming(wlen);
    y = v_enframe(x, wnd, inc)';
    %由于不考虑高频部分能量，高频设置到2k为止，查找bark表可知17个子带即可
    fn = size(y, 2);
    % fs2 = fix(fs/2);

    sourfft1 = abs(fft(y))'; %进行fft变化
    %获得sourfft中存贮的是每一帧fft（只有正频率部分的值），将其对应的频率取出
    ds = fs / wlen;
    freq = (0:wlen / 2) * fs / wlen;
    %考虑到一半鼾声的频率，只取5khz及以下，18个子带即可
    BPSE = zeros(fn, 17);
    BPS = zeros(fn, 17);

    for i = 1:fn
        Sr = sourfft1(i, :); %取每一帧
        Srt_en = zeros(1, 17);
        Src = zeros(1, 17);

        for k = 1:17
            m1 = Fk(k, 2);
            m2 = Fk(k, 3); %获得BARK滤波器组上下截止频率
            fx1 = fix(m1 / ds) + 1;
            fx2 = fix(m2 / ds) + 1; %转换为相应的点数
            Srt = Sr(fx1:fx2); %取来对应子带的谱线

            % 设置每个子带的窗函数
            %        wind =  gausswin(length(Srt));%设置三角窗函数
            %设置每个子带频域部分加窗
            %       Srt_wind =  wind'.* Srt;
            %       Srt_en(k) =Srt_wind*Srt_wind';

            %          Srt_en(k) =(Srt.*Srt)*wind;%对每个子带能量进行加窗，获得该帧子带的能量
            Srt_en(k) = Srt * Srt'; %获得该帧子带的能量
            fre1 = freq(fx1:fx2); %获得该子带的频率
            %        Src(k) = (fre1.*fre1)*(Srt.*Srt)';%获得子带修正频谱能量2阶矩
            Src(k) = fre1 * (Srt .* Srt)'; %获得子带修正频谱质心
        end

        BPS(i, :) = Src;
        BPSE(i, :) = Srt_en;
    end

    % BPSE1= sum(BPSE,1);
    % BPSE1 = BPSE1/sum(sum(BPSE));%计算归一化bark子带能量
    % BPSE1 = log10(1+BPSE1/2);%取对数能量
    % BPSE1  = BPSE1';
    % 计算归一化子带频谱质心
    BPS1 = sum(BPS, 1); %求取每个子带的修正频谱质心
    BPS1 = (BPS1 / sum(sum(BPS)))'; %进行归一化
    %%

    BPS2 = sum(BPS, 1);
    BPSEE1 = (BPS2 / sum(sum(BPSE)))';

    BPS3 = sum(BPSE, 1);
    BPSEE2 = (BPS3 / sum(sum(BPSE)))';
    %% 计算基于fisher子带频谱质心
    %
    % bfr1=[0.376083873937847,0.139332330866792,1,0.274653815473444,0.0703376133209820,0.147590555951415,0.0955192719811358,0.0540638040060680,0.00674094721063561,3.47697085040573e-05,0.00908669178657100,0.0604927184469863,0.0762114611214894,0.143460079453536,0.0720217528833452,0.0745119261968838,0.0236728461659368];
    % BPS1_weighted = bfr1'.*BPS1;%对各个分量填加权重

end
